import { OptionShape } from "@alfalab/core-components/select/shared";

export const officeSpecialty = {
  'Общая практика': 'Кабинет общей практики',
  'Акушерство и гинекология': 'Кабинет акушер-гинекологии',
  Хирургия: 'Кабинет хирургии',
  Стоматология: 'Кабинет стоматологии',
  Терапия: 'Кабинет терапии',
  Офтальмология: 'Кабинет офтальмологии',
  Педиатрия: 'Кабинет педиатрии',
  Кардиология: 'Кабинет кардиологии',
  Неврология: 'Кабинет неврологии',
  Эндокринология: 'Кабинет эндокринологии',
  Дерматология: 'Кабинет дерматологии',
  Психиатрия: 'Кабинет психиатрии',
} as const;


export const officeSpecialtyOptions: OptionShape[] = Object.entries(officeSpecialty).map(([key, value]) => ({
  key,
  content: value,
}));

